void Task2() {
    // Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

}

void Task4() {
    // Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
    
}

void Task6() {
    // Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
    
}

void Task8() {
    // Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
    
}

Task2();
Task4();
Task6();
Task8();